PAD
UNK
<sos>
<eos>
to
from
flights
the
on
me
what
flight
boston
show
san
denver
a
francisco
in
and
atlanta
i
pittsburgh
is
dallas
baltimore
all
philadelphia
like
are
list
airlines
of
that
between
washington
leaving
please
pm
fly
morning
for
would
fare
first
oakland
after
there
i'd
trip
ground
you
wednesday
round
transportation
cheapest
does
need
class
city
available
arriving
with
have
before
fares
which
afternoon
american
give
one
want
at
new
way
leave
york
arrive
dc
earliest
thursday
monday
go
airport
united
tuesday
nonstop
how
information
st.
am
can
milwaukee
find
twenty
miami
sunday
delta
evening
noon
newark
las
vegas
chicago
continental
any
o'clock
august
charlotte
do
toronto
phoenix
saturday
diego
orlando
seventh
fort
worth
stop
next
friday
july
houston
indianapolis
us
tell
early
air
seattle
what's
airline
kansas
5
or
downtown
code
cost
latest
tomorrow
los
angeles
aircraft
going
cleveland
stopover
around
an
salt
lake
6
twa
about
june
memphis
get
by
see
10
many
may
montreal
dollars
jose
7
tampa
ticket
petersburg
than
nashville
expensive
mean
could
8
12
i'm
leaves
long
minneapolis
international
type
much
travel
cincinnati
tacoma
departing
louis
service
daily
beach
know
meal
into
lowest
less
depart
least
economy
book
okay
paul
time
4
coach
november
detroit
northwest
serve
columbus
day
night
december
september
general
mitchell
used
last
9
it
california
serves
third
arrives
now
second
stops
return
make
flying
kind
love
field
as
1000
take
2
burbank
looking
out
breakfast
direct
possible
be
schedule
cities
stopping
number
price
eastern
fourth
fifth
has
la
restriction
airports
goes
this
dl
car
times
april
3
also
connecting
will
via
dinner
two
business
eighth
served
interested
1991
week
westchester
arrangements
using
through
airfare
late
most
ua
same
ontario
rental
fifteenth
today
county
back
your
other
then
thirtieth
twentieth
plane
ap
sixth
only
listing
bwi
ninth
returning
wednesdays
display
stand
types
classes
prices
north
carolina
flies
1
where
midwest
express
either
qx
should
smallest
limousine
tickets
transport
again
october
meals
canadian
florida
eleventh
capacity
twelfth
under
57
tenth
colorado
my
explain
sixteenth
seating
f
if
h
hi
fourteenth
nineteenth
y
ewr
jersey
when
landings
guardia
lunch
layover
seventeenth
live
airplane
thirty
makes
march
thank
but
11
mco
distance
weekday
shortest
planes
dfw
yes
hours
offer
no
traveling
right
people
over
some
serving
january
codes
trying
takeoffs
both
boeing
canada
use
logan
uses
abbreviation
numbers
1100
far
281
departure
during
each
days
arrivals
what're
ff
530
qo
nationair
eighteenth
these
southwest
yn
ohio
lufthansa
630
747
anywhere
provided
q
hp
ea
name
stopovers
sfo
430
466
later
booking
departures
weekdays
mornings
requesting
more
near
those
rates
following
825
another
departs
destination
838
ap57
thrift
midnight
2100
s
georgia
jfk
arrange
land
1115
1245
pennsylvania
sometime
hello
february
let's
starting
qw
seats
tuesdays
minnesota
their
originating
noontime
1992
choices
heading
kinds
services
415
passengers
america
west
555
area
thursdays
813
fn
options
1291
dc10
three
connections
six
texas
sixteen
trips
ten
21
sorry
connect
sundays
total
cheap
230
reservation
taxi
fit
define
close
718
costs
rentals
arrival
include
296
coming
meaning
ap80
f28
934
i'll
tennessee
provide
saturdays
help
plan
within
snack
atlanta's
american's
217
missouri
utah
d
carries
well
757
connection
210
1039
turboprop
we're
various
airplanes
852
schedules
who
stands
324
database
arizona
3724
abbreviations
bound
eight
delta's
just
1765
737
difference
b
ac
tower
201
343
720
755
co
without
wish
up
approximately
actually
serviced
72s
m80
restrictions
different
say
932
alaska
they
york's
itinerary
month
names
reservations
atl
cp
limo
845
1222
repeat
still
along
too
originate
describe
sa
1700
highest
amount
maximum
80
train
look
takeoff
2134
dulles
so
m
reaching
located
cars
dinnertime
here
lives
rent
transcontinental
727
505
thirteenth
making
buy
very
ord
767
nw
